#### KeynoteEntries Members

---

|  |
| --- |
| KeynoteEntries Class   Methods   Properties   See Also |

The  KeynoteEntries  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  KeyBasedTreeEntries  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | FindEntry | Finds the KeyBasedTreeEntry associated with the given key value. (Inherited from  KeyBasedTreeEntries  .) |
| Protected method | GetBasicIEnumerator | Returns an enumerator that iterates through a collection. (Inherited from  KeyBasedTreeEntries  .) |
| Public method | GetEnumerator | Returns an enumerator that iterates through a collection. (Inherited from  KeyBasedTreeEntries  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetKeyBasedTreeEntriesIterator | Returns a KeyBasedTreeEntriesIterator that iterates through the collection. (Inherited from  KeyBasedTreeEntries  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method Static member | LoadKeynoteEntriesFromFile | Loads the contents of a keynote text file into the provided KeyBasedTreeEntriesLoadContent. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  KeyBasedTreeEntries  .) |

# See Also

KeynoteEntries Class

Autodesk.Revit.DB Namespace